---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarModelBarDiameter
source: html/f2591d09-0c43-477d-5cc6-ab4b4d769281.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarModelBarDiameter Property

"Model Bar Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarModelBarDiameter { get; }
```